[
  { "title": "Invocation avant de dormir", "text": "C’est en Ton nom, ô Allah, que je meurs et que je vis." },
  { "title": "Invocation au réveil", "text": "Louange à Allah qui nous a donné la vie après nous avoir fait mourir, et vers Lui est la résurrection." },
  { "title": "Invocation en entrant aux toilettes", "text": "Ô Allah, je cherche refuge auprès de Toi contre les démons mâles et femelles." },
  { "title": "Invocation en sortant des toilettes", "text": "Je Te demande pardon." },
  { "title": "Invocation avant de manger", "text": "Au nom d’Allah." },
  { "title": "Invocation si l’on oublie de dire Bismillah au début du repas", "text": "Au nom d’Allah, au début et à la fin." },
  { "title": "Invocation après avoir mangé", "text": "Louange à Allah qui m’a nourri de ceci et me l’a accordé sans force ni puissance de ma part." },
  { "title": "Invocation en entrant dans la mosquée", "text": "Ô Allah, ouvre-moi les portes de Ta miséricorde." },
  { "title": "Invocation en sortant de la mosquée", "text": "Ô Allah, je Te demande de Ta grâce." },
  { "title": "Invocation avant les ablutions", "text": "Au nom d’Allah." },
  { "title": "Invocation après les ablutions", "text": "J’atteste qu’il n’y a de divinité digne d’adoration qu’Allah, seul et sans associé, et j’atteste que Muhammad est Son serviteur et Son messager. Ô Allah, fais que je sois parmi ceux qui se repentent et se purifient." },
  { "title": "Invocation en s’habillant", "text": "Louange à Allah qui m’a vêtu de ce vêtement et me l’a accordé sans force ni puissance de ma part." },
  { "title": "Invocation en se déshabillant", "text": "Au nom d’Allah." },
  { "title": "Invocation avant de quitter la maison", "text": "Au nom d’Allah, je place ma confiance en Allah, et il n’y a de force ni de puissance qu’en Allah." },
  { "title": "Invocation en entrant dans la maison", "text": "Au nom d’Allah, nous entrons, et au nom d’Allah, nous sortons, et en notre Seigneur nous plaçons notre confiance." },
  { "title": "Invocation en montant sur une monture ou dans un véhicule", "text": "Gloire à Celui qui nous a soumis ceci, alors que nous n’étions pas capables de le dominer, et c’est vers notre Seigneur que nous retournerons." },
  { "title": "Invocation au début d’un voyage", "text": "Ô Allah, nous Te demandons, durant ce voyage, la piété, la crainte et des actes qui Te plaisent." },
  { "title": "Invocation en entrant au marché", "text": "Il n’y a pas de divinité en dehors d’Allah, seul et sans associé. À Lui la royauté et la louange. Il donne la vie et la mort, Il est vivant et ne meurt pas. En Sa main est le bien, et Il est capable de toute chose." },
  { "title": "Invocation en entendant une bonne nouvelle", "text": "Louange à Allah." },
  { "title": "Invocation en entendant une mauvaise nouvelle", "text": "Certes, nous appartenons à Allah et c’est vers Lui que nous retournerons." }
]
